------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/szho/Dropbox (Penn)/My Projects/audit_paper/data/biprobit_new.lo
> g
  log type:  text
 opened on:   6 Mar 2022, 19:37:48

. 
. set seed 1234

. use "auditor_with_stratio.dta", clear

. 
. tab auditor, gen(auditor)

    auditor |
   identity |
      for 8 |      Freq.     Percent        Cum.
------------+-----------------------------------
         aa |      2,176        2.46        2.46
        bdo |      3,290        3.72        6.17
         dt |     11,717       13.23       19.41
         ey |     16,710       18.87       38.28
         gt |      3,821        4.32       42.59
       kpmg |     12,101       13.67       56.26
     others |     24,564       27.74       84.00
        pwc |     14,166       16.00      100.00
------------+-----------------------------------
      Total |     88,545      100.00

. sum stratio

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     stratio |     88,545    .0262089    .0532557          0          1

. gen stratio_r = (stratio - `r(mean)')/`r(sd)'

. 
. 
. global controls logassets_r lev_r investments_r cash_r roa_r logprice_r Intangible
> _r RD_r RDmissing numyears fracnonfees_r feemissing downgrade NoRate RateC retvol_
> r stratio_r sumlogret_r

. biprobit (bankrptobs = going_concern $controls auditor2-auditor8 year3-year15 ) (g
> oing_concern =  $controls auditor2-auditor8 year3-year15)

Fitting comparison equation 1:

Iteration 0:   log likelihood = -5366.5388  
Iteration 1:   log likelihood = -3756.5978  
Iteration 2:   log likelihood = -3443.3678  
Iteration 3:   log likelihood =  -3433.972  
Iteration 4:   log likelihood = -3433.9543  
Iteration 5:   log likelihood = -3433.9543  

Fitting comparison equation 2:

Iteration 0:   log likelihood = -14240.015  
Iteration 1:   log likelihood = -8765.1213  
Iteration 2:   log likelihood =  -7687.566  
Iteration 3:   log likelihood = -7636.4293  
Iteration 4:   log likelihood = -7636.0036  
Iteration 5:   log likelihood = -7636.0035  

Comparison:    log likelihood = -11069.958

Fitting full model:

Iteration 0:   log likelihood = -11069.958  
Iteration 1:   log likelihood = -11045.668  
Iteration 2:   log likelihood = -11042.022  
Iteration 3:   log likelihood =  -11041.91  
Iteration 4:   log likelihood =  -11041.91  

Seemingly unrelated bivariate probit                   Number of obs =  70,193
                                                       Wald chi2(77) = 8108.41
Log likelihood = -11041.91                             Prob > chi2   =  0.0000

-------------------------------------------------------------------------------
              | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
bankrptobs    |
going_concern |   .1866383   .1172492     1.59   0.111    -.0431659    .4164425
  logassets_r |   .2497531   .0341355     7.32   0.000     .1828488    .3166574
        lev_r |   .2254733   .0194209    11.61   0.000      .187409    .2635376
investments_r |  -.0279928   .0180939    -1.55   0.122    -.0634562    .0074707
       cash_r |   .0132594   .0228043     0.58   0.561    -.0314362    .0579549
        roa_r |  -.1817604    .028302    -6.42   0.000    -.2372313   -.1262894
   logprice_r |  -.5729437   .0421455   -13.59   0.000    -.6555473     -.49034
 Intangible_r |  -.0753388   .0161228    -4.67   0.000     -.106939   -.0437387
         RD_r |   -.076264   .0197009    -3.87   0.000     -.114877    -.037651
    RDmissing |    .013323   .0416647     0.32   0.749    -.0683383    .0949844
     numyears |  -.0190926   .0067191    -2.84   0.004    -.0322617   -.0059235
fracnonfees_r |   -.003371   .0196404    -0.17   0.864    -.0418654    .0351234
   feemissing |   .3730412   .1077038     3.46   0.001     .1619456    .5841368
    downgrade |   .2995293   .0926127     3.23   0.001     .1180119    .4810468
       NoRate |   -.008057   .0519768    -0.16   0.877    -.1099297    .0938158
        RateC |    .491544    .094266     5.21   0.000      .306786    .6763019
     retvol_r |   .0810088   .0271497     2.98   0.003     .0277963    .1342212
    stratio_r |   .0670849   .0119968     5.59   0.000     .0435717    .0905982
  sumlogret_r |  -.1099926   .0173841    -6.33   0.000    -.1440648   -.0759204
     auditor2 |  -.0394747   .0996384    -0.40   0.692    -.2347623    .1558129
     auditor3 |  -.1414222   .0843351    -1.68   0.094     -.306716    .0238716
     auditor4 |  -.1718946    .081431    -2.11   0.035    -.3314965   -.0122928
     auditor5 |  -.1379109   .1042085    -1.32   0.186    -.3421558     .066334
     auditor6 |  -.2967427   .0858147    -3.46   0.001    -.4649365   -.1285489
     auditor7 |  -.1631192   .0856137    -1.91   0.057    -.3309189    .0046806
     auditor8 |   -.213017   .0832913    -2.56   0.011    -.3762651    -.049769
        year3 |  -.1483079   .0639169    -2.32   0.020    -.2735826   -.0230332
        year4 |   .0161208   .0793489     0.20   0.839    -.1394002    .1716419
        year5 |   .1263774   .0844141     1.50   0.134    -.0390712    .2918261
        year6 |  -.0247291    .093225    -0.27   0.791    -.2074468    .1579886
        year7 |   .1283204   .0912381     1.41   0.160    -.0505029    .3071437
        year8 |   .3509219    .080301     4.37   0.000     .1935348     .508309
        year9 |    .027702   .0750101     0.37   0.712    -.1193151    .1747192
       year10 |  -.1768132   .0926654    -1.91   0.056     -.358434    .0048076
       year11 |    .120973   .0930891     1.30   0.194    -.0614784    .3034243
       year12 |  -.0608474   .0964458    -0.63   0.528    -.2498776    .1281828
       year13 |  -.1344982   .1060581    -1.27   0.205    -.3423683    .0733719
       year14 |   .1597526   .0983134     1.62   0.104     -.032938    .3524433
       year15 |   .1417394   .0947155     1.50   0.135    -.0438995    .3273784
        _cons |  -2.434377   .0895414   -27.19   0.000    -2.609875   -2.258879
--------------+----------------------------------------------------------------
going_concern |
  logassets_r |  -.2472466   .0288144    -8.58   0.000    -.3037219   -.1907713
        lev_r |   .2424948    .012921    18.77   0.000     .2171702    .2678195
investments_r |   .0047521   .0123643     0.38   0.701    -.0194815    .0289858
       cash_r |  -.2092395   .0155909   -13.42   0.000    -.2397972   -.1786818
        roa_r |  -.5219932   .0191964   -27.19   0.000    -.5596175   -.4843689
   logprice_r |  -.8384639   .0340725   -24.61   0.000    -.9052449    -.771683
 Intangible_r |  -.0574748   .0114821    -5.01   0.000    -.0799792   -.0349704
         RD_r |   .0703268   .0150052     4.69   0.000     .0409172    .0997365
    RDmissing |   .1269243   .0324222     3.91   0.000     .0633779    .1904706
     numyears |   -.024263   .0048486    -5.00   0.000    -.0337661   -.0147598
fracnonfees_r |  -.0222347   .0134517    -1.65   0.098    -.0485995    .0041301
   feemissing |   .2819293   .0756844     3.73   0.000     .1335905    .4302681
    downgrade |   .1435542   .0938196     1.53   0.126    -.0403289    .3274373
       NoRate |   .2361757   .0529462     4.46   0.000     .1324031    .3399483
        RateC |   .7994183   .0913711     8.75   0.000     .6203344    .9785023
     retvol_r |   .1565235   .0200408     7.81   0.000     .1172443    .1958027
    stratio_r |   .0453337   .0128881     3.52   0.000     .0200735    .0705938
  sumlogret_r |  -.0788192   .0117352    -6.72   0.000    -.1018197   -.0558187
     auditor2 |  -.1188817   .0795172    -1.50   0.135    -.2747326    .0369693
     auditor3 |  -.0390075    .071843    -0.54   0.587    -.1798173    .1018022
     auditor4 |  -.1321242   .0692385    -1.91   0.056    -.2678292    .0035809
     auditor5 |  -.2787573   .0827253    -3.37   0.001    -.4408959   -.1166188
     auditor6 |  -.0457584   .0706763    -0.65   0.517    -.1842815    .0927647
     auditor7 |  -.0666559   .0700316    -0.95   0.341    -.2039152    .0706035
     auditor8 |   .0230633   .0697949     0.33   0.741    -.1137322    .1598588
        year3 |   .0629259    .045809     1.37   0.170    -.0268581    .1527099
        year4 |   .2665024    .054884     4.86   0.000     .1589317    .3740732
        year5 |   .3812687   .0591153     6.45   0.000     .2654049    .4971325
        year6 |   .3618448   .0615234     5.88   0.000      .241261    .4824285
        year7 |   .4502309   .0631048     7.13   0.000     .3265479     .573914
        year8 |   .5169968   .0610975     8.46   0.000     .3972478    .6367457
        year9 |    .286026   .0553906     5.16   0.000     .1774624    .3945896
       year10 |   .3091416   .0602295     5.13   0.000      .191094    .4271891
       year11 |   .4345039   .0666231     6.52   0.000     .3039251    .5650828
       year12 |   .2674679   .0688327     3.89   0.000     .1325584    .4023775
       year13 |   .3961708   .0679506     5.83   0.000       .26299    .5293515
       year14 |   .4429557     .07084     6.25   0.000     .3041119    .5817995
       year15 |   .5100899   .0671089     7.60   0.000     .3785589     .641621
        _cons |  -2.819497   .0828579   -34.03   0.000    -2.981896   -2.657098
--------------+----------------------------------------------------------------
      /athrho |    .447713   .0703616     6.36   0.000     .3098069    .5856192
--------------+----------------------------------------------------------------
          rho |   .4200173   .0579488                      .3002614    .5267376
-------------------------------------------------------------------------------
LR test of rho=0: chi2(1) = 56.0958                       Prob > chi2 = 0.0000

. 
. predict prob_b1g1, p11 
(18,352 missing values generated)

. predict prob_b1g0, p10 
(18,352 missing values generated)

. 
. sum prob_b1g1 prob_b1g0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   prob_b1g1 |     70,193    .0075408    .0369703          0    .930531
   prob_b1g0 |     70,193    .0062466    .0135685   3.03e-08   .4044655

. 
. saveold "auditor_with_stratio_biprob_s1234.dta", version(12) replace
(saving in Stata 12 format, which can be read by Stata 11 or 12)
file auditor_with_stratio_biprob_s1234.dta saved

. 
. 
. 
. 
. 
. set seed 25678

. use "auditor_with_stratio.dta", clear

. 
. tab auditor, gen(auditor)

    auditor |
   identity |
      for 8 |      Freq.     Percent        Cum.
------------+-----------------------------------
         aa |      2,176        2.46        2.46
        bdo |      3,290        3.72        6.17
         dt |     11,717       13.23       19.41
         ey |     16,710       18.87       38.28
         gt |      3,821        4.32       42.59
       kpmg |     12,101       13.67       56.26
     others |     24,564       27.74       84.00
        pwc |     14,166       16.00      100.00
------------+-----------------------------------
      Total |     88,545      100.00

. sum stratio

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     stratio |     88,545    .0262089    .0532557          0          1

. gen stratio_r = (stratio - `r(mean)')/`r(sd)'

. 
. 
. global controls logassets_r lev_r investments_r cash_r roa_r logprice_r Intangible
> _r RD_r RDmissing numyears fracnonfees_r feemissing downgrade NoRate RateC retvol_
> r stratio_r sumlogret_r

. biprobit (bankrptobs = going_concern $controls auditor2-auditor8 year3-year15 ) (g
> oing_concern =  $controls auditor2-auditor8 year3-year15)

Fitting comparison equation 1:

Iteration 0:   log likelihood = -5366.5388  
Iteration 1:   log likelihood = -3756.5978  
Iteration 2:   log likelihood = -3443.3678  
Iteration 3:   log likelihood =  -3433.972  
Iteration 4:   log likelihood = -3433.9543  
Iteration 5:   log likelihood = -3433.9543  

Fitting comparison equation 2:

Iteration 0:   log likelihood = -14240.015  
Iteration 1:   log likelihood = -8765.1213  
Iteration 2:   log likelihood =  -7687.566  
Iteration 3:   log likelihood = -7636.4293  
Iteration 4:   log likelihood = -7636.0036  
Iteration 5:   log likelihood = -7636.0035  

Comparison:    log likelihood = -11069.958

Fitting full model:

Iteration 0:   log likelihood = -11069.958  
Iteration 1:   log likelihood = -11045.668  
Iteration 2:   log likelihood = -11042.022  
Iteration 3:   log likelihood =  -11041.91  
Iteration 4:   log likelihood =  -11041.91  

Seemingly unrelated bivariate probit                   Number of obs =  70,193
                                                       Wald chi2(77) = 8108.41
Log likelihood = -11041.91                             Prob > chi2   =  0.0000

-------------------------------------------------------------------------------
              | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
bankrptobs    |
going_concern |   .1866383   .1172492     1.59   0.111    -.0431659    .4164425
  logassets_r |   .2497531   .0341355     7.32   0.000     .1828488    .3166574
        lev_r |   .2254733   .0194209    11.61   0.000      .187409    .2635376
investments_r |  -.0279928   .0180939    -1.55   0.122    -.0634562    .0074707
       cash_r |   .0132594   .0228043     0.58   0.561    -.0314362    .0579549
        roa_r |  -.1817604    .028302    -6.42   0.000    -.2372313   -.1262894
   logprice_r |  -.5729437   .0421455   -13.59   0.000    -.6555473     -.49034
 Intangible_r |  -.0753388   .0161228    -4.67   0.000     -.106939   -.0437387
         RD_r |   -.076264   .0197009    -3.87   0.000     -.114877    -.037651
    RDmissing |    .013323   .0416647     0.32   0.749    -.0683383    .0949844
     numyears |  -.0190926   .0067191    -2.84   0.004    -.0322617   -.0059235
fracnonfees_r |   -.003371   .0196404    -0.17   0.864    -.0418654    .0351234
   feemissing |   .3730412   .1077038     3.46   0.001     .1619456    .5841368
    downgrade |   .2995293   .0926127     3.23   0.001     .1180119    .4810468
       NoRate |   -.008057   .0519768    -0.16   0.877    -.1099297    .0938158
        RateC |    .491544    .094266     5.21   0.000      .306786    .6763019
     retvol_r |   .0810088   .0271497     2.98   0.003     .0277963    .1342212
    stratio_r |   .0670849   .0119968     5.59   0.000     .0435717    .0905982
  sumlogret_r |  -.1099926   .0173841    -6.33   0.000    -.1440648   -.0759204
     auditor2 |  -.0394747   .0996384    -0.40   0.692    -.2347623    .1558129
     auditor3 |  -.1414222   .0843351    -1.68   0.094     -.306716    .0238716
     auditor4 |  -.1718946    .081431    -2.11   0.035    -.3314965   -.0122928
     auditor5 |  -.1379109   .1042085    -1.32   0.186    -.3421558     .066334
     auditor6 |  -.2967427   .0858147    -3.46   0.001    -.4649365   -.1285489
     auditor7 |  -.1631192   .0856137    -1.91   0.057    -.3309189    .0046806
     auditor8 |   -.213017   .0832913    -2.56   0.011    -.3762651    -.049769
        year3 |  -.1483079   .0639169    -2.32   0.020    -.2735826   -.0230332
        year4 |   .0161208   .0793489     0.20   0.839    -.1394002    .1716419
        year5 |   .1263774   .0844141     1.50   0.134    -.0390712    .2918261
        year6 |  -.0247291    .093225    -0.27   0.791    -.2074468    .1579886
        year7 |   .1283204   .0912381     1.41   0.160    -.0505029    .3071437
        year8 |   .3509219    .080301     4.37   0.000     .1935348     .508309
        year9 |    .027702   .0750101     0.37   0.712    -.1193151    .1747192
       year10 |  -.1768132   .0926654    -1.91   0.056     -.358434    .0048076
       year11 |    .120973   .0930891     1.30   0.194    -.0614784    .3034243
       year12 |  -.0608474   .0964458    -0.63   0.528    -.2498776    .1281828
       year13 |  -.1344982   .1060581    -1.27   0.205    -.3423683    .0733719
       year14 |   .1597526   .0983134     1.62   0.104     -.032938    .3524433
       year15 |   .1417394   .0947155     1.50   0.135    -.0438995    .3273784
        _cons |  -2.434377   .0895414   -27.19   0.000    -2.609875   -2.258879
--------------+----------------------------------------------------------------
going_concern |
  logassets_r |  -.2472466   .0288144    -8.58   0.000    -.3037219   -.1907713
        lev_r |   .2424948    .012921    18.77   0.000     .2171702    .2678195
investments_r |   .0047521   .0123643     0.38   0.701    -.0194815    .0289858
       cash_r |  -.2092395   .0155909   -13.42   0.000    -.2397972   -.1786818
        roa_r |  -.5219932   .0191964   -27.19   0.000    -.5596175   -.4843689
   logprice_r |  -.8384639   .0340725   -24.61   0.000    -.9052449    -.771683
 Intangible_r |  -.0574748   .0114821    -5.01   0.000    -.0799792   -.0349704
         RD_r |   .0703268   .0150052     4.69   0.000     .0409172    .0997365
    RDmissing |   .1269243   .0324222     3.91   0.000     .0633779    .1904706
     numyears |   -.024263   .0048486    -5.00   0.000    -.0337661   -.0147598
fracnonfees_r |  -.0222347   .0134517    -1.65   0.098    -.0485995    .0041301
   feemissing |   .2819293   .0756844     3.73   0.000     .1335905    .4302681
    downgrade |   .1435542   .0938196     1.53   0.126    -.0403289    .3274373
       NoRate |   .2361757   .0529462     4.46   0.000     .1324031    .3399483
        RateC |   .7994183   .0913711     8.75   0.000     .6203344    .9785023
     retvol_r |   .1565235   .0200408     7.81   0.000     .1172443    .1958027
    stratio_r |   .0453337   .0128881     3.52   0.000     .0200735    .0705938
  sumlogret_r |  -.0788192   .0117352    -6.72   0.000    -.1018197   -.0558187
     auditor2 |  -.1188817   .0795172    -1.50   0.135    -.2747326    .0369693
     auditor3 |  -.0390075    .071843    -0.54   0.587    -.1798173    .1018022
     auditor4 |  -.1321242   .0692385    -1.91   0.056    -.2678292    .0035809
     auditor5 |  -.2787573   .0827253    -3.37   0.001    -.4408959   -.1166188
     auditor6 |  -.0457584   .0706763    -0.65   0.517    -.1842815    .0927647
     auditor7 |  -.0666559   .0700316    -0.95   0.341    -.2039152    .0706035
     auditor8 |   .0230633   .0697949     0.33   0.741    -.1137322    .1598588
        year3 |   .0629259    .045809     1.37   0.170    -.0268581    .1527099
        year4 |   .2665024    .054884     4.86   0.000     .1589317    .3740732
        year5 |   .3812687   .0591153     6.45   0.000     .2654049    .4971325
        year6 |   .3618448   .0615234     5.88   0.000      .241261    .4824285
        year7 |   .4502309   .0631048     7.13   0.000     .3265479     .573914
        year8 |   .5169968   .0610975     8.46   0.000     .3972478    .6367457
        year9 |    .286026   .0553906     5.16   0.000     .1774624    .3945896
       year10 |   .3091416   .0602295     5.13   0.000      .191094    .4271891
       year11 |   .4345039   .0666231     6.52   0.000     .3039251    .5650828
       year12 |   .2674679   .0688327     3.89   0.000     .1325584    .4023775
       year13 |   .3961708   .0679506     5.83   0.000       .26299    .5293515
       year14 |   .4429557     .07084     6.25   0.000     .3041119    .5817995
       year15 |   .5100899   .0671089     7.60   0.000     .3785589     .641621
        _cons |  -2.819497   .0828579   -34.03   0.000    -2.981896   -2.657098
--------------+----------------------------------------------------------------
      /athrho |    .447713   .0703616     6.36   0.000     .3098069    .5856192
--------------+----------------------------------------------------------------
          rho |   .4200173   .0579488                      .3002614    .5267376
-------------------------------------------------------------------------------
LR test of rho=0: chi2(1) = 56.0958                       Prob > chi2 = 0.0000

. 
. predict prob_b1g1, p11 
(18,352 missing values generated)

. predict prob_b1g0, p10 
(18,352 missing values generated)

. 
. sum prob_b1g1 prob_b1g0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   prob_b1g1 |     70,193    .0075408    .0369703          0    .930531
   prob_b1g0 |     70,193    .0062466    .0135685   3.03e-08   .4044655

. 
. saveold "auditor_with_stratio_biprob_s25678.dta", version(12) replace
(saving in Stata 12 format, which can be read by Stata 11 or 12)
file auditor_with_stratio_biprob_s25678.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/szho/Dropbox (Penn)/My Projects/audit_paper/data/biprobit_new.lo
> g
  log type:  text
 closed on:   6 Mar 2022, 19:38:04
------------------------------------------------------------------------------------
